; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 11508)
	(= (fuel plane1) 4877)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at plane2 city1)
	(= (capacity plane2) 5574)
	(= (fuel plane2) 13)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city0)
	(= (capacity plane3) 5132)
	(= (fuel plane3) 709)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 8)
	(at person1 city3)
	(at person2 city4)
	(at person3 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 887)
	(= (distance city0 city2) 863)
	(= (distance city0 city3) 597)
	(= (distance city0 city4) 877)
	(= (distance city1 city0) 887)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 598)
	(= (distance city1 city3) 767)
	(= (distance city1 city4) 539)
	(= (distance city2 city0) 863)
	(= (distance city2 city1) 598)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 895)
	(= (distance city2 city4) 511)
	(= (distance city3 city0) 597)
	(= (distance city3 city1) 767)
	(= (distance city3 city2) 895)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 732)
	(= (distance city4 city0) 877)
	(= (distance city4 city1) 539)
	(= (distance city4 city2) 511)
	(= (distance city4 city3) 732)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city3)
	(at person3 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 2990, (fuel plane1) from 4877 to 1887
   goals met: 1 of 3
2. (refuel plane3 city0)
   changed: (fuel plane3) from 709 to 5132
   goals met: 1 of 3
3. (fly plane3 city0 city3)
   deleted: (at plane3 city0)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 2990 to 4184, (fuel plane3) from 5132 to 3938
   goals met: 1 of 3
4. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 3
5. (fly plane3 city3 city4)
   deleted: (at plane3 city3)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 4184 to 5648, (fuel plane3) from 3938 to 2474
   goals met: 1 of 3
6. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 3
7. (fly plane3 city4 city3)
   deleted: (at plane3 city4)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 5648 to 7112, (fuel plane3) from 2474 to 1010
   goals met: 1 of 3
8. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 2 of 3
9. (refuel plane3 city3)
   changed: (fuel plane3) from 1010 to 5132
   goals met: 2 of 3
10. (fly plane3 city3 city1)
   deleted: (at plane3 city3)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 7112 to 8646, (fuel plane3) from 5132 to 3598
   goals met: 2 of 3
11. (debark person1 plane3 city1)
   deleted: (in person1 plane3)
   added: (at person1 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 3
